src/CF/DataProcessors/УсловияДляЗаполненияТаблицыТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>УсловияДляЗаполненияТаблицыТовары</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОтборПоГруппамНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоНоменклатурнымГруппам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоПроизводителям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоРегионам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CF/DataProcessors/УсловияДляЗаполненияТаблицыТовары/Forms/Форма/Ext/Form/Module.bsl
//sza131005-0239 : 

&НаКлиенте
Процедура ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокумента(Команда)
	ЭтаФорма.Закрыть(ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокументаНаСервере());
КонецПроцедуры

&НаСервере
Функция ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокументаНаСервере()
	СтруктураОтбора = Новый Структура;
	
	ГруппыНоменклатуры = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоГруппамНоменклатуры Цикл
		ГруппыНоменклатуры.Добавить(СтрГрН.ГруппаНоменклатуры);
	конеццикла;
	СтруктураОтбора.Вставить("ГруппыНоменклатуры", ГруппыНоменклатуры);
	
	НоменклатурныеГруппы = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоНоменклатурнымГруппам Цикл
		НоменклатурныеГруппы.Добавить(СтрГрН.НоменклатурнаяГруппа);
	конеццикла;
	СтруктураОтбора.Вставить("НоменклатурныеГруппы", НоменклатурныеГруппы);
	
	Производители = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоПроизводителям Цикл
		Производители.Добавить(СтрГрН.Производитель);
	конеццикла;
	СтруктураОтбора.Вставить("Производители", Производители);
	
	Регионы = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоРегионам Цикл
		Регионы.Добавить(СтрГрН.Регион);
	конеццикла;
	СтруктураОтбора.Вставить("Регионы", Регионы);
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры
